{
  "Provider": "m365",
  "CheckID": "defender_identity_sensors_deployed",
  "CheckTitle": "Ensure Defender for Identity sensors are deployed on Domain Controllers",
  "CheckType": [],
  "ServiceName": "defender",
  "SubServiceName": "identity",
  "ResourceIdTemplate": "",
  "Severity": "high",
  "ResourceType": "Defender for Identity Sensor",
  "ResourceGroup": "security",
  "Description": "Microsoft Defender for Identity (MDI) requires sensors to be deployed on Domain Controllers to detect identity-based threats. Without sensors, MDI cannot monitor authentication events, detect lateral movement, or identify credential theft attacks.",
  "Risk": "Without deployed MDI sensors, organizations have no visibility into identity-based attacks on Domain Controllers. Attackers can perform Pass-the-Hash, Golden Ticket, Kerberoasting, and other identity attacks without detection, potentially compromising the entire Active Directory infrastructure.",
  "RelatedUrl": "",
  "AdditionalURLs": [
    "https://learn.microsoft.com/en-us/defender-for-identity/install-sensor",
    "https://learn.microsoft.com/en-us/graph/api/resources/security-sensor"
  ],
  "Remediation": {
    "Code": {
      "CLI": "",
      "NativeIaC": "",
      "Other": "1. Navigate to Microsoft Defender XDR portal at https://security.microsoft.com/\n2. Go to Settings > Identities > Sensors\n3. Download the sensor installer package\n4. Install the sensor on each Domain Controller\n5. Configure the Directory Service account for the sensor\n6. Verify the sensor status shows as healthy",
      "Terraform": ""
    },
    "Recommendation": {
      "Text": "Deploy Defender for Identity sensors on all Domain Controllers to enable comprehensive identity threat detection and protect against credential-based attacks.",
      "Url": "https://learn.microsoft.com/en-us/defender-for-identity/deploy-defender-identity"
    }
  },
  "Categories": [
    "e5"
  ],
  "DependsOn": [],
  "RelatedTo": [
    "defender_identity_health_issues_no_open"
  ],
  "Notes": "This check requires SecurityIdentitiesHealth.Read.All permission. Sensors can be standalone or integrated with Domain Controllers."
}
