{
  "Provider": "stackit",
  "CheckID": "objectstorage_bucket_encryption",
  "CheckTitle": "Ensure Object Storage buckets have encryption enabled",
  "CheckType": [
    "Software and Configuration Checks/Industry and Regulatory Standards"
  ],
  "ServiceName": "objectstorage",
  "SubServiceName": "",
  "ResourceIdTemplate": "",
  "Severity": "high",
  "ResourceType": "Bucket",
  "Description": "Ensure that all Object Storage buckets have encryption at rest enabled to protect data. StackIT emphasizes data sovereignty and GDPR compliance, making encryption at rest a fundamental security requirement.",
  "Risk": "Without encryption at rest, data stored in Object Storage buckets is vulnerable to unauthorized access if the storage media is compromised. This violates GDPR requirements and data protection best practices, potentially exposing sensitive business data.",
  "RelatedUrl": "https://docs.stackit.cloud/stackit/en/basic-concept-objectstorage-71009785.html",
  "AdditionalURLs": [
    "https://www.stackit.de/en/product/object-storage/",
    "https://docs.stackit.cloud/"
  ],
  "Remediation": {
    "Code": {
      "CLI": "",
      "NativeIaC": "",
      "Other": "Enable server-side encryption for the Object Storage bucket through the STACKIT portal or API. Navigate to your bucket settings and enable encryption at rest to ensure all data is encrypted before being written to disk.",
      "Terraform": ""
    },
    "Recommendation": {
      "Text": "Enable server-side encryption for all Object Storage buckets to ensure data is encrypted at rest. This helps meet GDPR requirements and protects sensitive data from unauthorized access.",
      "Url": "https://hub.prowler.com/check/stackit/objectstorage_bucket_encryption"
    }
  },
  "Categories": [
    "encryption",
    "data-protection"
  ],
  "DependsOn": [],
  "RelatedTo": [],
  "Notes": "StackIT is a German cloud provider emphasizing data sovereignty and GDPR compliance. Encryption at rest is essential for meeting these compliance requirements and protecting sensitive European business data. All StackIT data centers are located in Germany and Austria, ensuring data remains within EU jurisdiction."
}
