{
  "Provider": "alibabacloud",
  "CheckID": "cs_kubernetes_dashboard_disabled",
  "CheckTitle": "Ensure Kubernetes web UI / Dashboard is not enabled",
  "CheckType": [
    "Software and Configuration Checks",
    "Industry and Regulatory Standards",
    "CIS Alibaba Cloud Foundations Benchmark"
  ],
  "ServiceName": "cs",
  "SubServiceName": "",
  "ResourceIdTemplate": "acs:cs:region:account-id:cluster/{cluster-id}",
  "Severity": "high",
  "ResourceType": "AlibabaCloudKubernetesCluster",
  "Description": "Dashboard is a web-based Kubernetes user interface. It can be used to deploy containerized applications to a Kubernetes cluster, troubleshoot your containerized application, and manage the cluster itself. You should disable the Kubernetes Web UI (Dashboard) when running on Kubernetes Engine. The Kubernetes Web UI (Dashboard) is backed by a highly privileged Kubernetes Service Account. It is recommended to use ACK User Console instead of Dashboard to avoid any privileged escalation via compromise the dashboard.",
  "Risk": "The Kubernetes Dashboard is backed by a highly privileged Service Account. If the Dashboard is compromised, it could allow an attacker to gain full control over the cluster and potentially escalate privileges.",
  "RelatedUrl": "https://www.alibabacloud.com/help/doc-detail/86494.html",
  "Remediation": {
    "Code": {
      "CLI": "Use kubectl to delete the dashboard deployment: kubectl delete deployment kubernetes-dashboard -n kube-system",
      "NativeIaC": "",
      "Other": "",
      "Terraform": ""
    },
    "Recommendation": {
      "Text": "Logon to ACK console. Select the target cluster and select the kube-system namespace in the Namespace pop-menu. Input dashboard in the deploy filter bar, make sure there is no result exist after the filter, delete the dashboard deployment by selecting the Delete in More pop-menu.",
      "Url": "https://www.alibabacloud.com/help/doc-detail/86494.html"
    }
  },
  "Categories": [
    "cluster-security"
  ],
  "DependsOn": [],
  "RelatedTo": [],
  "Notes": "This check aligns with CIS Alibaba Cloud Foundations Benchmark Section 7.5. By default, the kube-dashboard would not install in cluster."
}
